After coming across this project tonight, I also tried using the same example and have the same result. After performing an apply, I have the below output

```
data.template_file.userdata_default: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # esxi_guest.vmtest will be created
  + resource "esxi_guest" "vmtest" {
      + boot_disk_size         = (known after apply)
      + boot_disk_type         = "thin"
      + disk_store             = "wd_4tb_2"
      + guest_name             = "vmtest06"
      + guest_shutdown_timeout = (known after apply)
      + guest_startup_timeout  = (known after apply)
      + guestinfo              = {
          + "userdata"          = "H4sIAAAAAAAA/3yOMU8DMQxGd/+Kj958dM/QCSSYGFAFG0oT9y4i2CefA+Lfo7QgMUCnRPr0nt+QqrY8JpVjmYiWmF7jxGsgjBBfvp8cnfs3NatEAx7e2axk7hs+is9Is6l84uxpFr2oQAX7QxNvJL4EAljioXIOcGtM6PhLqoXFw48BA/Yrrzh3FSmOzMfYqv95g8iapLfc7SN6J3ZbU/XtSdD566rTaeU0K+64VsXt8+M9ntRqvsLuMrC5UeFfOZt/gC8AAAD//wEAAP//wKKUOkoBAAA="
          + "userdata.encoding" = "gzip+base64"
        }
      + guestos                = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + memsize                = (known after apply)
      + notes                  = (known after apply)
      + numvcpus               = (known after apply)
      + ovf_properties_timer   = (known after apply)
      + ovf_source             = "groovy-server-cloudimg-amd64.ova"
      + power                  = (known after apply)
      + resource_pool_name     = "/"
      + virthwver              = (known after apply)

      + network_interfaces {
          + mac_address     = (known after apply)
          + nic_type        = (known after apply)
          + virtual_network = "Internal"
        }

      + ovf_properties {
          + key   = "password"
          + value = "Passw0rd1"
        }
      + ovf_properties {
          + key   = "hostname"
          + value = "HelloWorld"
        }
      + ovf_properties {
          + key   = "user-data"
          + value = "I2Nsb3VkLWNvbmZpZwoKcGFja2FnZXM6CiAtIG50cAogLSBudHBkYXRlCiAtIGN1cmwKCiMgT3ZlcnJpZGUgbnRwIHdpdGggY2hyb255IGNvbmZpZ3VyYXRpb24gb24gVWJ1bnR1Cm50cDoKICBlbmFibGVkOiB0cnVlCiAgbnRwX2NsaWVudDogY2hyb255ICAjIFVzZXMgY2xvdWQtaW5pdCBkZWZhdWx0IGNocm9ueSBjb25maWd1cmF0aW9uCgpydW5jbWQ6CiAgLSBkYXRlID4vcm9vdC9jbG91ZGluaXQubG9nCiAgLSBlY2hvIEhlbGxvIEVYU0kgV29ybGQhID4+L3Jvb3QvY2xvdWRpbml0LmxvZwogIC0gZWNobyAiRG9uZSBjbG91ZC1pbml0IiA+Pi9yb290L2Nsb3VkaW5pdC5sb2cK"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudinit = <<~EOT
        #cloud-config

        packages:
         - ntp
         - ntpdate
         - curl

        # Override ntp with chrony configuration on Ubuntu
        ntp:
          enabled: true
          ntp_client: chrony  # Uses cloud-init default chrony configuration

        runcmd:
          - date >/root/cloudinit.log
          - echo Hello EXSI World! >>/root/cloudinit.log
          - echo "Done cloud-init" >>/root/cloudinit.log
    EOT
  + ip        = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

esxi_guest.vmtest: Creating...
esxi_guest.vmtest: Still creating... [10s elapsed]
esxi_guest.vmtest: Still creating... [20s elapsed]
esxi_guest.vmtest: Still creating... [30s elapsed]
esxi_guest.vmtest: Still creating... [40s elapsed]
esxi_guest.vmtest: Creation complete after 48s [id=135]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

cloudinit = #cloud-config

packages:
 - ntp
 - ntpdate
 - curl

# Override ntp with chrony configuration on Ubuntu
ntp:
  enabled: true
  ntp_client: chrony  # Uses cloud-init default chrony configuration

runcmd:
  - date >/root/cloudinit.log
  - echo Hello EXSI World! >>/root/cloudinit.log
  - echo "Done cloud-init" >>/root/cloudinit.log

ip =
```
The vm appeared 'off' the entire process. If that is expected, I am not sure.
I powered up the vm and tried logging in but the password did not seem to be what was defined in the config file and could not log in

```
ovf_properties {
    key = "password"
    value = "Passw0rd1"
}
```
based on the output of terraform, it does not look like the cloud-init ran. I've tried the config with and without setting "power = on" and did not appear to make a difference.